<?php
echo "My firt php program <br/>";

$a = 10;
$b = 20;
$c = $a + $b;

//PHP_EOL = перенос строки???

echo  "a = $a <br/>";
echo  "b = $b <br/>";
echo  "c = $c <br/>";
echo "<hr>";

//Begin1
echo "Begin1. Дана сторона квадрата а. Найти его периметр P = 4 * a. <br>";

$a = 10;
$p = 4 * $a;

echo  "Если сторона квадрата а = $a <br/>";
echo  "То его  периметр  = $p <br/>";
echo "<hr>";

//Begin2
echo "Begin2. Дана сторона квадрата а. Найти его площадь S = a2. <br/>";

$a = 10;
$s = $a * $a;

echo  "Если сторона квадрата а = $a <br/>";
echo  "То его  площадь  = $s <br/>";
echo "<hr>";
//Begin3
echo "Begin3. Даны стороны прямоугольника a и b. Найти его площадь S = a * b и периметр P = 2 * (a + b). <br/>";

$a = 10;
$b = 15;
$s = $a * $b;
$p = 2 * ($a + $b);
echo "Если a = $a <br/>";
echo "И b = $b <br/>";
echo "То  площадь прямоугольника = $s <br/>";
echo "А его периметр = $p <br/>";
echo "<hr>";

//Begin4
echo "Begin4. Дан диаметр окружности d. Найти ее длину L = p * d. В качестве значения p использовать 3.14. <br/>";

$d = 10;
$p = 3.14;
$l = $p * $d;
echo "Если диаметр окружности  = $a <br/>";
echo "То ее длина = $l <br/>";
echo "<hr>";

//Begin5
echo "Begin5. Дана длина ребра куба а. Найти объем куба V = a3 и площадь поверхности S = 6 * a2. <br/>";

$a = 2;
$v = pow($a,3);
$s = 6 * pow($a,2);
echo "Если длина ребра куба  = $a <br/>";
echo "То тогда его объем будет = $v <br/>";
echo "А площадь поверзности = $s <br/>";
echo "<hr>";

//Begin6
echo "Begin6. Даны длины ребер а,b,c, прямоугольного паралелепипеда. Найти его объем  V = a * b * c и площадь поверхности S = 2 * (a * b + a * c + b * c). <br/>";

$a = 2;
$b = 5;
$c = 3;
$v = $a * $b * $c;
$s = 2 *($a * $b + $a * $c + $b * $c);
echo "Если первое ребро  = $a <br/>";
echo "Второе = $b <br/>";
echo "И третье = $c <br/>";
echo "То объем паралелепипеда будет = $v <br/>";
echo "А его площадь = $s <br/>";
echo "<hr>";

//Begin7
echo "Begin7. Найти длину окружности L и площадь круга S заданного радиуса R:  L = 2 * p * R, S = p * R2. <br/>";

$r = 14;
$p = 3.14;
$l = 2 * $p * $r;
$s = $p * pow($r,2);
echo "Если радиус  = $r <br/>";
echo "То длина окружности = $l <br/>";
echo "А его площадь = $s <br/>";
echo "<hr>";

//Begin8
echo "Begin8. Даны 2 числа a и b. Найти их среднее арифметическое (a + b) /2 <br/>";

$a = 4;
$b = 10;
$m = ($a + $b)/2;
echo "Число а  = $a <br/>";
echo "Число б = $b <br/>";
echo "Среднее арифметическое = $m <br/>";
echo "<hr>";

//Begin9
echo "Begin9. Даны 2 неотрицательных числа a и b. Найти их среднее геометрическое, тоесть квадратный корень из их произведения: a * b <br/>";

$a = 11;
$b = 7;
$g = sqrt($a * $b);
echo "Число а  = $a <br/>";
echo "Число б = $b <br/>";
echo "Среднее геометрическое = $g <br/>" ;
echo "<hr>";

//Begin10
echo "Begin10. Даны 2 ненулевых числа. найти сумму, разность, произведение и частное их квадратов <br/>";

$a = 10;
$b = 13;
$s = pow($a,2) + pow($b,2);
$r = pow($a,2) - pow($b,2);
$p = pow($a,2) * pow($b,2);
$ch = pow($a,2) / pow($b,2);
echo "Число а  = $a <br/>";
echo "Число б = $b <br/>";
echo "Сумма = $s <br/>" ;
echo "Разность = $r <br/>" ;
echo "Произведение = $p <br/>" ;
echo "Частное = $ch <br/>" ;
echo "<hr>";
