<?php
echo "My firt php program <br/>";

$a = 10;
$b = 20;
$c = $a + $b;

//PHP_EOL = перенос строки???

echo  "a = $a <br/>";
echo  "b = $b <br/>";
echo  "c = $c <br/>";
echo "<hr>";

//Begin1
echo "Begin1. Дана сторона квадрата а. Найти его периметр P = 4 * a. <br><br/>";

$a = 10;
$p = 4 * $a;

echo  "Если сторона квадрата а = $a <br/>";
echo  "То его  периметр  = $p <br/>";
echo "<hr>";

//Begin2
echo "Begin2. Дана сторона квадрата а. Найти его площадь S = a2. <br/><br/>";

$a = 10;
$s = $a * $a;

echo  "Если сторона квадрата а = $a <br/>";
echo  "То его  площадь  = $s <br/>";
echo "<hr>";
//Begin3
echo "Begin3. Даны стороны прямоугольника a и b. Найти его площадь S = a * b и периметр P = 2 * (a + b). <br/><br/>";

$a = 10;
$b = 15;
$s = $a * $b;
$p = 2 * ($a + $b);
echo "Если a = $a <br/>";
echo "И b = $b <br/>";
echo "То  площадь прямоугольника = $s <br/>";
echo "А его периметр = $p <br/>";
echo "<hr>";

//Begin4
echo "Begin4. Дан диаметр окружности d. Найти ее длину L = pi * d. В качестве значения pi использовать 3.14. <br/><br/>";

$d = 10;
$p = 3.14;
$l = $p * $d;
echo "Если диаметр окружности  = $a <br/>";
echo "То ее длина = $l <br/>";
echo "<hr>";

//Begin5
echo "Begin5. Дана длина ребра куба а. Найти объем куба V = a3 и площадь поверхности S = 6 * a2. <br/><br/>";

$a = 2;
$v = pow($a,3);
$s = 6 * pow($a,2);
echo "Если длина ребра куба  = $a <br/>";
echo "То тогда его объем будет = $v <br/>";
echo "А площадь поверзности = $s <br/>";
echo "<hr>";

//Begin6
echo "Begin6. Даны длины ребер а,b,c, прямоугольного паралелепипеда. Найти его объем  V = a * b * c и площадь поверхности S = 2 * (a * b + a * c + b * c). <br/><br/>";

$a = 2;
$b = 5;
$c = 3;
$v = $a * $b * $c;
$s = 2 *($a * $b + $a * $c + $b * $c);
echo "Если первое ребро  = $a <br/>";
echo "Второе = $b <br/>";
echo "И третье = $c <br/>";
echo "То объем паралелепипеда будет = $v <br/>";
echo "А его площадь = $s <br/>";
echo "<hr>";

//Begin7
echo "Begin7. Найти длину окружности L и площадь круга S заданного радиуса R:  L = 2 * pi * R, S = pi * R2. <br/><br/>";

$r = 14;
$p = 3.14;
$l = 2 * $p * $r;
$s = $p * pow($r,2);
echo "Если радиус  = $r <br/>";
echo "То длина окружности = $l <br/>";
echo "А его площадь = $s <br/>";
echo "<hr>";

//Begin8
echo "Begin8. Даны 2 числа a и b. Найти их среднее арифметическое (a + b) /2 <br/><br/>";

$a = 4;
$b = 10;
$m = ($a + $b)/2;
echo "Число а  = $a <br/>";
echo "Число б = $b <br/>";
echo "Среднее арифметическое = $m <br/>";
echo "<hr>";

//Begin9
echo "Begin9. Даны 2 неотрицательных числа a и b. Найти их среднее геометрическое, тоесть квадратный корень из их произведения: a * b <br/><br/>";

$a = 11;
$b = 7;
$g = sqrt($a * $b);
echo "Число а  = $a <br/>";
echo "Число б = $b <br/>";
echo "Среднее геометрическое = $g <br/>" ;
echo "<hr>";

//Begin10
echo "Begin10. Даны 2 ненулевых числа. найти сумму, разность, произведение и частное их квадратов <br/><br/>";

$a = 10;
$b = 13;
$s = pow($a,2) + pow($b,2);
$r = pow($a,2) - pow($b,2);
$p = pow($a,2) * pow($b,2);
$ch = pow($a,2) / pow($b,2);
echo "Число а  = $a <br/>";
echo "Число б = $b <br/>";
echo "Сумма = $s <br/>" ;
echo "Разность = $r <br/>" ;
echo "Произведение = $p <br/>" ;
echo "Частное = $ch <br/>" ;
echo "<hr>";

//Begin11
echo "Begin11. Даны 2 ненулевых числа. найти сумму, разность, произведение и частное их модулей <br/><br/>";

$a = -10;
$b = -13;
$s = abs($a) + abs($b);
$r = abs($a) - abs($b);
$p = abs($a) * abs($b);
$ch = abs($a) / abs($b);
echo "Число а  = $a <br/>";
echo "Число б = $b <br/>";
echo "Сумма = $s <br/>" ;
echo "Разность = $r <br/>" ;
echo "Произведение = $p <br/>" ;
echo "Частное = $ch <br/>" ;
echo "<hr>";

//Begin12
echo "Begin12. Даны катеты прямоугольного треугольника a и b. Найти его гипотенузу c и периметр P: c = a2 + b2,  P = a + b + c <br/><br/>";

$a = 23;
$b = 12;
$c = sqrt($a + $b);
$p = $a + $b + $c;;
echo "Первый катет а  = $a <br/>";
echo "Второй катет б = $b <br/>";
echo "Гипотенуза = $c <br/>" ;
echo "периметр = $p <br/>" ;
echo "<hr>";

//Begin13
echo "Begin13. Даны 2 круга с общим центром и радиусами R1 и R2 (R1 > R2). найти площадь этих кругов S1 и S2, а так же площадь S3 кольца, внешний радиус которого равен R1, а внутрунний R2:<br/>
S1 = pi * (R1)2<br/>
S2 = pi * (R2)2<br/>
S2 = S1 - S2<br/>
<br/>";

$f_r = 26;
$s_r = 16;
$f_s = (pi() * ($f_r)) * 2;
$s_s = (pi() * ($s_r)) * 2;
$t_s = $f_s - $s_s;
echo "Первый радиус R1  = $f_r <br/>";
echo "Второй радиус R2 = $s_r <br/>";
echo "S1 = $f_s <br/>" ;
echo "S2 = $s_s <br/>" ;
echo "S3 = $t_s <br/>" ;
echo "<hr>";

//Begin14
echo "Begin14. Дана длина окружности L. Найти ее радиус R и площадь круга S, ограниченного этой окружностью, учитывая что: L = 2 * pi * R, S = pi * R2 <br/><br/>";

$l = 19;
$r = 2 * pi() * $l;
$s = pi() * pow($r,2);
echo "Длина окружности L = $l <br/>" ;
echo "Радиус = $r <br/>" ;
echo "Площадь = $s <br/>" ;
echo "<hr>";

//Begin15
echo "Begin15. Дана площадь круга S. Найти его диаметр D и длину L окружности, ограничивающей этот круг, учитывая, что: L  = 2 * pi * R, S = pi * R2<br/><br/>";

$s = 4;
$r = abs($s / pi());
$d = 2 * $r;
$l = 2 * pi() * $r;
echo "Площадь круга = $s <br/>" ;
echo "Диаметр = $d <br/>" ;
echo "Длина = $l <br/>" ;
echo "<hr>";
